[문1] 아래 조건을 만족하는 Series를 생성하세요.
1) 데이터 : 1~50 범위에서 7의 배수 정수
2) 인덱스 : 'a~z' 범위에서 데이터 갯수 만큼의 알파벳
3) 타  입 : 부호가 없는 1바이트 정수
4) 이  름 : sevens
5) 속  성 : index, values, dtype, ndim, shape, size

In [20]:
listsevens=[]
for i in range(7,51,7):
    listsevens.append(i)
alpha=["a","b","c","d","e","f","g"]

In [21]:
listsevens

[7, 14, 21, 28, 35, 42, 49]

In [28]:
sevens=pd.Series(index=alpha,data=listsevens)
sevens.info()
print(sevens.index,sevens.values,sevens.dtype,sevens.ndim,sevens.shape,sevens.size,sep='\n\n')

<class 'pandas.core.series.Series'>
Index: 7 entries, a to g
Series name: None
Non-Null Count  Dtype
--------------  -----
7 non-null      int64
dtypes: int64(1)
memory usage: 112.0+ bytes
Index(['a', 'b', 'c', 'd', 'e', 'f', 'g'], dtype='object')

[ 7 14 21 28 35 42 49]

int64

1

(7,)

7

[문2] 아래 조건을 만족하는 데이터 객체를 생성하세요.
1) 데이터 : knu_data.csv
2) 인덱스 : 컬럼 중 하나를 인덱스로 설정
3) 속성 정보 출력
4) 데이터 확인 정보 출력
5) 타입과 실제 데이터 타입 일치

In [3]:
import pandas as pd

In [4]:
file='./DATA/knu_data.csv'

In [5]:
knuDF=pd.read_csv(file,parse_dates=["time"])

In [6]:
knuDF

   mem_id    team                time
0  knu_21   경영지원팀 2023-11-02 20:00:00
1  knu_03   대외협력팀 2023-11-17 20:00:00
2  knu_01   대외협력팀 2023-11-09 20:00:00
3  knu_09   경영지원팀 2022-11-22 20:00:00
4  knu_01   경영지원팀 2022-11-11 20:00:00

In [7]:
knuDF=knuDF.set_index("mem_id")

In [8]:
knuDF

          team                time
mem_id
knu_21   경영지원팀 2023-11-02 20:00:00
knu_03   대외협력팀 2023-11-17 20:00:00
knu_01   대외협력팀 2023-11-09 20:00:00
knu_09   경영지원팀 2022-11-22 20:00:00
knu_01   경영지원팀 2022-11-11 20:00:00

In [9]:
knuDF.info()

<class 'pandas.core.frame.DataFrame'>
Index: 5 entries, knu_21 to knu_01
Data columns (total 2 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   team    5 non-null      object
 1   time    5 non-null      datetime64[ns]
dtypes: datetime64[ns](1), object(1)
memory usage: 120.0+ bytes

In [10]:
knuDF.index

Index(['knu_21', 'knu_03', 'knu_01', 'knu_09', 'knu_01'], dtype='object', name='mem_id')

In [11]:
knuDF.shape

(5, 2)

In [12]:
knuDF.size

10

In [13]:
knuDF["team"]=knuDF["team"].astype("category")

In [14]:
knuDF.info()

<class 'pandas.core.frame.DataFrame'>
Index: 5 entries, knu_21 to knu_01
Data columns (total 2 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   team    5 non-null      category
 1   time    5 non-null      datetime64[ns]
dtypes: category(1), datetime64[ns](1)
memory usage: 209.0+ bytes

[문3] 아래 조건을 만족하는 데이터 객체를 생성하세요.
1) 데이터 : stats_100701.xlsx
2) 년도별 인구가 가장 많은 지역과 가장 적은 지역
3) 6대 광역시에서 년도별 인구가 가장 많은 지역과 가장 적은 지역
4) 8도 중 7도에서 년도별 인구가 가장 많은 지역과 가장 적은 지역

In [15]:
import pandas as pd
import numpy as np

In [16]:
dfile='./DATA/stats_100701.xlsx'

In [72]:
numDF=pd.read_excel(dfile,na_filter=None,header=0,index_col=0)

In [88]:
numDF.reset_index(drop=True)

    Unnamed: 1  Unnamed: 2  Unnamed: 3  Unnamed: 4
0         2015        2016        2017        2018
1        51015       51218       51362       51607
2         9941        9843        9766        9705
3         3452        3447        3424        3400
4         2469        2461        2458        2450
5         2883        2907        2924        2939
6         1506        1502        1495        1493
7         1542        1536        1528        1518
8         1164        1166        1159        1154
9          187         234         266         304
10       12423       12600       12786       13031
11        1517        1521        1521        1521
12        1589        1601        1609        1619
13        2103        2126        2153        2180
14        1835        1835        1829        1820
15        1797        1798        1795        1790
16        2678        2683        2675        2674
17        3330        3338        3339        3356
18         599         618         635         653
19       25247       25350       25476       25675

죄송합니다...

In [ ]:
numDF.info()

[문4] 아래 조건을 만족하는 데이터 객체를 생성하세요.
1) 데이터 : stock price.xlsx
2) 데이터 로딩 시 인덱스로 사용할 수 있는 컬럼 설정
3) 결측치 처리 =>
   (가) 1개라도 NaN이면 모두 제거 / price가 NaN이면 제거 / value가 10000이하면 제거
   (나) 평균값으로 결측치 대체, 이전/이후 값으로 결측치 대체
4) value가 1000이하 이거나 price가 90000이상인 데이터

In [40]:
import pandas as pd
import numpy as np

In [41]:
datafile='./DATA/stock price.xlsx'

In [52]:
stock=pd.read_excel(datafile,index_col=0)

In [53]:
stock

       stock_name          value     price
id
128940       한미약품   59385.666667  421000.0
138040    메리츠금융지주     827.500000       NaN
130960     CJ E&M   58540.666667   98900.0
138250      엔에스쇼핑   14558.666667   13200.0
139480        이마트  239230.833333  254500.0
142280     녹십자엠에스     468.833333   10200.0
145990        삼양사   82750.000000   82000.0
181710  NHN엔터테인먼트            NaN       NaN
185750        종근당   40293.666667  100500.0
192400      쿠쿠홀딩스  179204.666667  177500.0
199800         툴젠   -2514.333333  115400.0
204210     모두투어리츠    3093.333333    3475.0
207940   삼성바이오로직스            NaN   91900.0

3) 결측치 처리 =>
   (가) 1개라도 NaN이면 모두 제거 / price가 NaN이면 제거 / value가 10000이하면 제거
   (나) 평균값으로 결측치 대체, 이전/이후 값으로 결측치 대체

In [59]:
stock.dropna(how='any')

       stock_name          value     price
id
128940       한미약품   59385.666667  421000.0
130960     CJ E&M   58540.666667   98900.0
138250      엔에스쇼핑   14558.666667   13200.0
139480        이마트  239230.833333  254500.0
142280     녹십자엠에스     468.833333   10200.0
145990        삼양사   82750.000000   82000.0
185750        종근당   40293.666667  100500.0
192400      쿠쿠홀딩스  179204.666667  177500.0
199800         툴젠   -2514.333333  115400.0
204210     모두투어리츠    3093.333333    3475.0

In [60]:
stock.dropna(subset=['price'],how='all')

       stock_name          value     price
id
128940       한미약품   59385.666667  421000.0
130960     CJ E&M   58540.666667   98900.0
138250      엔에스쇼핑   14558.666667   13200.0
139480        이마트  239230.833333  254500.0
142280     녹십자엠에스     468.833333   10200.0
145990        삼양사   82750.000000   82000.0
185750        종근당   40293.666667  100500.0
192400      쿠쿠홀딩스  179204.666667  177500.0
199800         툴젠   -2514.333333  115400.0
204210     모두투어리츠    3093.333333    3475.0
207940   삼성바이오로직스            NaN   91900.0

(가)

In [66]:
stockmask=stock["value"]>10000
stock=stock[stockmask]
stock

       stock_name          value     price
id
128940       한미약품   59385.666667  421000.0
130960     CJ E&M   58540.666667   98900.0
138250      엔에스쇼핑   14558.666667   13200.0
139480        이마트  239230.833333  254500.0
145990        삼양사   82750.000000   82000.0
185750        종근당   40293.666667  100500.0
192400      쿠쿠홀딩스  179204.666667  177500.0

#### 4) value가 1000이하 이거나 price가 90000이상인 데이터

In [67]:
stockmasku1000=stock['value']<=1000
stockmaskup90000=stock['value']>=90000
stock[stockmasku1000|stockmaskup90000]

       stock_name          value     price
id
139480        이마트  239230.833333  254500.0
192400      쿠쿠홀딩스  179204.666667  177500.0